{"keras_version": "2.0.3", "config": [{"config": {"activity_regularizer": null, "padding": "valid", "dtype": "float32", "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 150, 150, 3], "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_1", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 32, "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 64, "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 64, "name": "dense_1", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"units": 1, "name": "dense_2", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}